[  
   {  
      "id":0,
      "title":"Heavy Metal",
      "description":"The protagonist arrives on a Harley, kills the dragon, drinks a few beers and fucks the princess."
   },
   {  
      "id":1,
      "title":"Trash Metal",
      "description":"The protagonist arrives, fights the dragon, saves the princess and fucks her."
   },
   {  
      "id":2,
      "title":"Power Metal",
      "description":"The protagonist arrives riding a white unicorn, escapes from the dragon, saves the princess and makes love to her in an enchanted forest."
   },
   {  
      "id":3,
      "title":"Folk Metal",
      "description":"The protagonist arrives with some friends playing accordions, violins, flutes and many more weird instruments, the dragon falls sleep (because of all the dancing). Then they all leave without the princess."
   },
   {  
      "id":4,
      "title":"Viking Metal",
      "description":"The protagonist arrives in a ship, kills the dragon with his mighty axe, skins the dragon and eats it, rapes the princess to death, steals her belongings and burns the castle before leaving."
   },
   {  
      "id":5,
      "title":"Death Metal",
      "description":"The protagonist arrives, kills the dragon, fucks the princess and kills her, fucks her again, then leaves."
   },
   {  
      "id":6,
      "title":"Doom Metal",
      "description":"The protagonist arrives, sees the size of the dragon and thinks he could never beat him, then he gets depressed and commits suicide. The dragon eats his body and the princess as dessert. That's the end of the sad story."
   },
   {  
      "id":7,
      "title":"Progessive Metal",
      "description":"The protagonist arrives with a guitar and plays a solo of 26 minutes. The dragon kills himself out of boredom. The protagonist arrives at the princess bedroom, plays another solo with all the techniques and tunes he learned in the last year at the conservatory. The princess escapes looking for the HEAVY METAL protagonist."
   },
   {  
      "id":8,
      "title":"Grind Gore",
      "description":"The protagonist arrives, screams something completely undecipherable for about 2 minutes and then leaves."
   }
]